In [1]:
import pandas as pd

nums = [1,2,3,4,5,6,7,8,9]
sq_nums = [num ** 2 for num in nums]
sq_nums

In [3]:
nums = [1,2,3,4,5,6,7,8,9] 
sq_nums = [num ** 2 for num in nums] 
sq_nums

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [4]:
data = {
    "nums": nums,
    "sq_nums" : sq_nums
}

In [6]:
df = pd.DataFrame(data)
df

   nums  sq_nums
0     1        1
1     2        4
2     3        9
3     4       16
4     5       25
5     6       36
6     7       49
7     8       64
8     9       81

In [10]:
fruits = ["apple", "cherry", "kiwi", "avocado", "dragonfruit", "watermelon","orange", "banana", "grape"]
ds = pd.Series(fruits)
ds

0          apple
1         cherry
2           kiwi
3        avocado
4    dragonfruit
5     watermelon
6         orange
7         banana
8          grape
dtype: object

In [8]:
squares = df["sq_nums"]
squares

0     1
1     4
2     9
3    16
4    25
5    36
6    49
7    64
8    81
Name: sq_nums, dtype: int64

In [11]:
df["fruits"] = ds
df

   nums  sq_nums       fruits
0     1        1        apple
1     2        4       cherry
2     3        9         kiwi
3     4       16      avocado
4     5       25  dragonfruit
5     6       36   watermelon
6     7       49       orange
7     8       64       banana
8     9       81        grape

In [12]:
df.head(3)

   nums  sq_nums  fruits
0     1        1   apple
1     2        4  cherry
2     3        9    kiwi

In [14]:
user_list = [
    {
        "username": "Chad",
        "password": "Pass1",
        "user_id": 1,
        "posts": 40

    },
     {
        "username": "Brad",
        "password": "Word2",
        "user_id": 2,
        "posts": 50

    },
     {
        "username": "Plad",
        "password":"Word3",
        "user_id": 3,
        "posts": 60

    },
     {
        "username": "Dad",
        "password": "Secret2",
        "user_id": 4,
        "posts": 20,
         "friends": [1,3]

    },
]
user_df =pd.DataFrame(user_list)
user_df

  username password  user_id  posts friends
0     Chad    Pass1        1     40     NaN
1     Brad    Word2        2     50     NaN
2     Plad    Word3        3     60     NaN
3      Dad  Secret2        4     20  [1, 3]

In [16]:
index_vals = ["x","y","z"]
one_vals = [1,2,3]
two_vals = [4,5,6]

In [17]:
one_series = pd.Series(one_vals, index = index_vals)
one_series

x    1
y    2
z    3
dtype: int64

In [18]:
two_series = pd.Series(two_vals, index = index_vals)
two_series

x    4
y    5
z    6
dtype: int64

In [20]:
index_data = {
    "one_data" : one_series,
    "two_data" : two_series
}
index_df = pd.DataFrame(index_data)
index_df

   one_data  two_data
x         1         4
y         2         5
z         3         6

In [21]:
cars = {
    "Honda": 42000,
    "Toyota": 37000,
    "Ford": 39000
}
cars_series = pd.Series(cars)
cars_series

Honda     42000
Toyota    37000
Ford      39000
dtype: int64

In [22]:
cars1 = {
    "Honda": 42000,
    "Toyota": 37000,
    "Ford": 39000
}
cars1_series = pd.Series(cars, index=["Honda","Ford"])
cars1_series

Honda    42000
Ford     39000
dtype: int64

In [23]:
df.loc[4]

nums                 5
sq_nums             25
fruits     dragonfruit
Name: 4, dtype: object

In [24]:
df.loc[4]["fruits"]

'dragonfruit'

In [25]:
index_df.loc["x"]

one_data    1
two_data    4
Name: x, dtype: int64

In [26]:
df.tail(3)

   nums  sq_nums  fruits
6     7       49  orange
7     8       64  banana
8     9       81   grape

In [27]:
df.tail(-2)

   nums  sq_nums       fruits
2     3        9         kiwi
3     4       16      avocado
4     5       25  dragonfruit
5     6       36   watermelon
6     7       49       orange
7     8       64       banana
8     9       81        grape

In [28]:
df.head(-2)

   nums  sq_nums       fruits
0     1        1        apple
1     2        4       cherry
2     3        9         kiwi
3     4       16      avocado
4     5       25  dragonfruit
5     6       36   watermelon
6     7       49       orange

In [32]:
df.loc[[1,2,8]]

   nums  sq_nums  fruits
1     2        4  cherry
2     3        9    kiwi
8     9       81   grape

In [33]:
df.iloc[4]

nums                 5
sq_nums             25
fruits     dragonfruit
Name: 4, dtype: object

In [34]:
df.iloc[[1,2,8]]

   nums  sq_nums  fruits
1     2        4  cherry
2     3        9    kiwi
8     9       81   grape

In [35]:
first_index = index_df.iloc[0]
first_index

one_data    1
two_data    4
Name: x, dtype: int64